<?php

require __DIR__.'/vendor/autoload.php';


/**
 * 微信支付之扫码支付
 *
 * Class WeixinPay
 */
class WeixinPay
{
    /**
     * 业务流程
     * （1）商户后台系统根据用户选购的商品生成订单。
     * （2）用户确认支付后调用微信支付【统一下单API】生成预支付交易；
     * （3）微信支付系统收到请求后生成预支付交易单，并返回交易会话的二维码链接code_url。
     * （4）商户后台系统根据返回的code_url生成二维码。
     * （5）用户打开微信“扫一扫”扫描二维码，微信客户端将扫码内容发送到微信支付系统。
     * （6）微信支付系统收到客户端请求，验证链接有效性后发起用户支付，要求用户授权。
     * （7）用户在微信客户端输入密码，确认支付后，微信客户端提交授权。
     * （8）微信支付系统根据用户授权完成支付交易。
     * （9）微信支付系统完成支付交易后给微信客户端返回交易结果，并将交易结果通过短信、微信消息提示用户。微信客户端展示支付交易结果页面。
     * （10）微信支付系统通过发送异步消息通知商户后台系统支付结果。商户后台系统需回复接收情况，通知微信后台系统不再发送该单的支付通知。
     * （11）未收到支付通知的情况，商户后台系统调用【查询订单API】。
     * （12）商户确认订单已支付后给用户发货。
     */

    /**
     * 统一下单
     */
    private function unifiedOrder()
    {

    }

    /**
     * 获取code_url
     */
    public function getCodeUrl()
    {

    }

    /**
     * 获生成支付二维码
     */
    public function QRCode()
    {

    }

    /**
     * 异步通知
     */
    public function notify()
    {

    }

}